'use client';

import React from 'react';

import { Container } from '@components/layout';
import { Typography } from '@components/typography';
import { theme } from 'src/theme';

export default function TermsPolicy() {
  return (
    <Container
      headerProps={{
        back: true,
      }}
      bodyProps={{
        style: {
          backgroundColor: theme.palette.common.white,
          padding: '0 30px 30px 30px',
          alignItems: 'flex-start',
        },
      }}
    >
      <div
        style={{
          display: 'flex',
          justifyContent: 'space-between',
          alignItems: 'center',
          width: '100%',
          marginTop: '14px',
        }}
      >
        <Typography variant={'h3'}>개인정보 처리방침</Typography>
      </div>

      <Typography
        variant={'subtitle2'}
        color={'gray.dark'}
        style={{ marginTop: '24px' }}
      >
        저희 원두잇은 ‘개인정보 보호법’에 따라 고객의 개인정보를 보호하고 이와
        관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이
        개인정보 처리방침을 수립하여 공개합니다. 제1조 (개인정보의 처리 목적)
        원두잇 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는
        개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이
        변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등
        필요한 조치를 이행할 예정입니다. 수집 목적목적의 상세내용회원 가입 및
        관리회원 가입의사 확인, 본인확인, 서비스에 대한 본인식별, 부정이용자
        식별 및 이용 방지, 공지 사항 전달, 회원 탈퇴 의사 확인서비스 제공신규
        서비스 또는 제품 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및
        참여기회 제공, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계고충
        처리민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지,
        처리결과 통보 제2조 (개인정보의 처리 항목 및 보유 기간) ① 원두잇은
        법령에 따른 개인정보 보유, 이용기간 또는 정보주체로부터 개인정보를 수집
        시에 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리 및
        보유합니다. ② 원칙적으로, 원두잇은 개인정보 수집 및 이용목적이 달성된
        후에는 해당 정보를 지체 없이 파기합니다. 다만 아래와 같이 원두잇 정책에
        따른 사유 또는 법령에서 정하는 사유에 따라 보관하여야 하는 경우 해당
        정보를 보유합니다. 이러한 정보는 아래 및 관련 법령에서 정하는 기간 동안
        보관 후 즉시 파기하며, 이에 따라 보관하는 기간 동안에도 아래 또는
        법령에서 정한 목적 외의 사유로 이용되지 않습니다. 서비스명수집단계필수
        수집 항목수집 및 이용 목적회원가입휴대전화번호, 성별, 출생년도,
        이메일회원가입 및 식별서비스 이용 시 서비스 이용기록, 접속 로그포인트
        적립 서비스의 제공중복 참여 및 부정이용 방지를 위한 기록 관리계좌이체
        서비스 이용 시성명, 은행계좌 정보보유 포인트 사용고객문의 접수 시이메일
        계정, 전화번호CS 고객 응대, 제휴 문의 및 장애 지원 서비스 제공캐시버튼
        채널링서비스 이용 시암호화 user id, 서비스 이용기록, 접속 로그포인트
        적립 서비스의 제공중복 참여 및 부정이용 방지를 위한 기록 관리계좌이체
        서비스 이용 시성명, 은행계좌 정보보유 포인트 사용고객문의 접수 시이메일
        계정, 전화번호CS 고객 응대, 제휴 문의 및 장애 지원 서비스
        제공캐시룰렛서비스 이용 시암호화 user id, 서비스 이용기록, 접속
        로그포인트 적립 서비스의 제공중복 참여 및 부정이용 방지를 위한 기록
        관리고객문의 접수 시이메일 계정, 전화번호CS 고객 응대, 제휴 문의 및 장애
        지원 서비스 제공에드캐시서비스 이용 시서비스 이용기록, 접속 로그광고
        서비스 제공 ③ 원두잇이 전자상거래 등에서의 소비자보호에 관한 법률,
        전자금융거래법 등 관련 법령의 규정에 의하여 보관하는 개인정보 및 해당
        법령은 아래 표와 같습니다. 보존 항목근거 법령보존 기간계약 또는 청약철회
        등에 관한 기록전자상거래 등에서의 소비자보호에 관한 법률5 년대금결제 및
        재화 등의 공급에 관한 기록소비자의 불만 또는 분쟁처리에 관한 기록3
        년표시/광고에 관한 기록6 개월전자금융 거래에 관한 기록전자금융거래법5
        년웹사이트 방문기록통신비밀보호법3 개월 제3조 (정보주체와 법정대리인의
        권리, 의무 및 행사방법) ① 정보주체는 원두잇에 대해 언제든지 다음 각 호의
        개인정보 보호 관련 권리를 행사할 수 있습니다. 개인정보 열람요구 오류
        등이 있을 경우 정정 요구 삭제요구 처리정지 요구 ② 제1항에 따른 권리
        행사는 원두잇잇에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여
        하실 수 있으며 원두잇은은 이에 대해 지체없이 조치하겠습니다. ③
        정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는
        원두잇은은 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나
        제공하지 않습니다. ④ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나
        위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보
        보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다. ⑤
        정보주체는 개인정보 보호법 등 관계 법령을 위반하여 회사가 처리하고 있는
        정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니됩니다.
        제4조 (개인정보 파기에 관한 사항) ① 원두잇은은 개인정보 보유기간의 경과,
        처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당
        개인정보를 파기합니다. ② 정보주체로부터 동의 받은 개인정보 보유기간이
        경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라
        개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의
        데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다. ③ 원두잇은
        ‘개인정보 유효기간제’에 따라 1년간 서비스를 이용하지 않은 회원의
        개인정보를 별도로 분리 보관 또는 삭제하여 관리하고 있습니다. ④ 개인정보
        파기의 절차 및 방법은 다음과 같습니다 파기절차회사는 파기 사유가 발생한
        개인정보를 선정하고, 원두잇은 개인정보 보호책임자의 승인을 받아
        개인정보를 파기합니다. 파기방법회사는 전자적 파일 형태로 기록, 저장된
        개인정보는 기록을 재생할 수 없도록 로우레밸포멧(Low Level Format) 등의
        방법을 이용하여 파기하며, 종이 문서에 기록, 저장된 개인정보는 분쇄기로
        분쇄하거나 소각하여 파기합니다. 제5조 (개인정보의 안정성 확보조치에 관한
        사항) 원두잇은 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고
        있습니다. 관리적 조치 : 내부관리계획 수립 및 시행 제6조 (개인정보
        보호책임자) ① 원두잇은 개인정보 처리에 관한 업무를 총괄해서 책임지고,
        개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여
        아래와 같이 개인정보 보호책임자를 지정하고 있습니다. 개인정보 보호
        책임자 성명 : 연락처 : ② 정보주체는 원두잇 서비스을 이용하시면서 발생한
        모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을
        개인정보 보호책임자에게 문의하실 수 있습니다. 원두잇은은 정보주체의
        문의에 대해 지체 없이 답변 및 처리 해드릴 것입니다. 제10조 (개인정보
        처리방침 변경에 관한 사항) ① 이 개인정보 처리방침은 2023.11.01부터
        적용됩니다.
      </Typography>
    </Container>
  );
}
